tap "hashicorp/tap"
brew "actionlint"
brew "awk"
brew "aws-cdk"
brew "aws-sam-cli"
brew "awscli"
brew "awslogs"
brew "bash"
brew "bash-completion"
brew "bat"
brew "btop"
brew "cfn-lint"
brew "cmake"
brew "cmatrix"
brew "cmus"
brew "ctop"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "highlight"
brew "htop"
brew "hyperfine"
brew "imagemagick"
brew "jq"
brew "neovim"
brew "ntfy"
brew "oh-my-posh"
brew "ollama", restart_service: :changed
brew "ossp-uuid"
brew "poetry"
brew "postgresql", restart_service: :changed, link: true
brew "postgresql@16",
brew "pyenv"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "stow"
brew "tldx"
brew "tlrc"
brew "tmux"
brew "uv"
brew "yazi"
brew "yq"
brew "zsh"
brew "zsh-completions"
cask "blender"
cask "claude-code@latest"
cask "codex"
cask "copilot-cli"
cask "datagrip"
cask "font-meslo-lg-nerd-font"
cask "gimp"
cask "insomnia"
cask "intellij-idea"
cask "open-webui"
cask "sf-symbols"
cask "vlc"
vscode "anysphere.remote-ssh"
vscode "dbaeumer.vscode-eslint"
vscode "graphql.vscode-graphql-syntax"
npm "corepack"
