brew "atuin", restart_service: :changed
brew "awk"
brew "awscli"
brew "bash-completion"
brew "cmake"
brew "cmatrix"
brew "emacs", restart_service: :changed
brew "ffmpeg"
brew "gh"
brew "git"
brew "git-delta"
brew "jq"
brew "neovim"
brew "oh-my-posh"
brew "ollama", restart_service: :changed
brew "postgresql@18", restart_service: :changed, link: true
brew "pyenv"
brew "ripgrep"
brew "stow"
brew "tmux"
brew "zsh"
brew "zsh-completions"
cask "blender"
cask "font-meslo-lg-nerd-font"
cask "gimp"
cask "insomnia"
cask "open-webui"
cask "sf-symbols"
vscode "anysphere.remote-ssh"
npm "corepack"
